# CantCutHostWithInstance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CutFailures..::..CantCutHostWithInstance Property
BuiltInFailures..::..CutFailures Class See Also
---
Can't cut host with instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantCutHostWithInstance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantCutHostWithInstance As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantCutHostWithInstance {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CutFailures Class
Autodesk.Revit.DB Namespace